Autodesk.Revit.DB.Architecture.Railing.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Architecture.RailingPlacementPosition)
Automatically creates new railings with the specified railing type on all sides of a stairs element.
document:
The document.
stairsId:
The stairs to which the new railing will host.
The stairs should have no associated railings yet.
railingTypeId:
The railing type of the new railing is to be created.
placePosition:
The placement position of the new railing.
Returns:
The new railing instances successfully created on the stairs.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The stairsId is not a stairs or ramp element.
-or-
The railingTypeId is not a railing type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The stairsId already has associated railings or is in editing mode so association of railings is not permitted.
Since:
2013